sed 명령은 편집 스크립트에 따라 지정된 File 매개변수에서 행을 수정하고 표준 출력에 작성합니다. sed 명령에는 수정하려는 행을 선택하고 선택된 행만 변경하기 위한 많은 기능이 포함됩니다.
sed 명령은 수정되는 행을 보유하기 위해 두 개의 작업공간을 사용합니다. 즉, 선택된 행이 보유되는 곳에는 패턴 공간을 사용하고 행이 임시로 저장될 수 있는 곳에는 보유 공간을 사용합니다.

편집 스크립트는 별도의 각 행에 개별 부속 명령으로 구성됩니다. sed 부속 명령의 일반 형식은 다음과 같습니다.
sed 명령은 입력 행을 패턴 공간으로 읽어들이고 주소가 해당 행을 선택하는 순서로 모든 sed 부속 명령을 적용하며 표준 출력에 패턴 공간을 기록하여 각 입력 File 매개변수를 처리합니다. 그런 다음, 패턴 공간을 지우고 입력 File 매개변수에 지정되는 각 행에 대해 이 프로세스를 반복합니다. 일부 sed 부속 명령은 보류 영역을 사용하여 후속 검색을 위해 패턴 공간의 일부 또는 모두를 저장합니다.
-e 스크립트	편집 스크립트로서 스크립트 변수를 사용합니다. 하나의 -e 플래그와 -f 플래그도 사용하고 있지 않으면, -e 플래그는 생략될 수 있습니다.
-f ScriptFile	편집 스크립트의 소스로서 ScriptFile 변수를 사용합니다. ScriptFile 변수는 File 매개변수에 적용되는 준비된 편집 명령 세트입니다.
-n	표준 출력으로 정상적으로 기록된 모든 정보를 억제합니다.
-u	버퍼없음 모드에서 출력을 표시합니다. 이 플래그가 설정될 때, sed 명령은 출력을 버퍼링하는 대신 즉시 출력을 표시합니다. 디폴트는 버퍼링된 모드입니다.
